#  Exercise 1

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
data=pd.read_csv('Data/algebradata.csv')

In [3]:
data.head()

     Fname     Lname Gender Grade  Hours of Study
0     Mary  Ettienne      F     B              16
1  Charles    Looner      M     F               8
2    Betty  Franklin      F     A              24
3    Roger   Withers      M     C               5
4     John   Mulgrew      M     A               5

In [4]:
#quality report

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 999 entries, 0 to 998
Data columns (total 5 columns):
Fname             999 non-null object
Lname             999 non-null object
Gender            999 non-null object
Grade             999 non-null object
Hours of Study    999 non-null int64
dtypes: int64(1), object(4)
memory usage: 39.1+ KB

In [7]:
data.isnull().sum()

Fname             0
Lname             0
Gender            0
Grade             0
Hours of Study    0
dtype: int64

In [8]:
data.describe()

       Hours of Study
count      999.000000
mean        15.115115
std          8.991187
min          0.000000
25%          7.000000
50%         15.000000
75%         23.000000
max         30.000000

In [10]:
data.Grade.unique()

array(['B', 'F', 'A', 'C', 'D'], dtype=object)

In [9]:
# we can create another column that can determine if student pass exam or not

In [18]:
# transform grades to numbers

In [19]:
def score_to_numeric(x):
    if x=='A':
        return 5
    if x=='B' :
        return 4
    if x=='C' :
        return 3
    if  x=='D':
        return 2
    if x=='F':
        return 1

data['Grade_val']=data['Grade'].apply(score_to_numeric)
data.head()

     Fname     Lname Gender Grade  Hours of Study Result  Grade_val
0     Mary  Ettienne      F     B              16   Fail          4
1  Charles    Looner      M     F               8   Fail          1
2    Betty  Franklin      F     A              24   Fail          5
3    Roger   Withers      M     C               5   Fail          3
4     John   Mulgrew      M     A               5   Fail          5

In [20]:
data['Result']=np.where(data['Grade_val'] > 1, 'Pass','Fail')

In [21]:
data.head()

     Fname     Lname Gender Grade  Hours of Study Result  Grade_val
0     Mary  Ettienne      F     B              16   Pass          4
1  Charles    Looner      M     F               8   Fail          1
2    Betty  Franklin      F     A              24   Pass          5
3    Roger   Withers      M     C               5   Pass          3
4     John   Mulgrew      M     A               5   Pass          5

In [27]:
percentage=(data[data['Result']=='Pass'].value_counts()/data['Result'].value_counts())*100

AttributeError: 'DataFrame' object has no attribute 'value_counts'

In [26]:
data.Result.value_counts()

Pass    916
Fail     83
Name: Result, dtype: int64

In [31]:
percentage=916/999*100

In [32]:
percentage

91.69169169169169

In [33]:
data_w=data[data['Gender']=='F']

In [34]:
data_w.Result.value_counts()

Pass    494
Fail     24
Name: Result, dtype: int64

In [35]:
per=494/518*100
per

95.36679536679536

In [38]:
pd.pivot_table(data,values=['Hours of Study'],index='Gender', aggfunc='mean',margins=True)

        Hours of Study
Gender
F            15.666023
M            14.521830
All          15.115115

In [39]:
data_p=data[data['Result']=='Pass']

In [40]:
pd.pivot_table(data_p, values=['Hours of Study'], index='Result')

        Hours of Study
Result
Pass         15.875546

# Exercise 2

In [41]:
data2=pd.read_csv('Data/axisdata.csv')

In [42]:
data2.head()

,Fname,Lname,Gender,Hours Worked,SalesTraining,Years Experience,Cars Sold
0,Jada,Walters,F,39,N,3,2
1,Nicole,Henderson,F,46,N,3,6
2,Tanya,Moore,F,42,Y,4,6
3,Ronelle,Jackson,F,38,Y,5,3
4,Brad,Sears,M,33,N,4,2

In [43]:
data2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 999 entries, 0 to 998
Data columns (total 7 columns):
Fname               999 non-null object
Lname               999 non-null object
Gender              999 non-null object
Hours Worked        999 non-null int64
SalesTraining       999 non-null object
Years Experience    999 non-null int64
Cars Sold           999 non-null int64
dtypes: int64(3), object(4)
memory usage: 54.7+ KB

In [46]:
data2.describe()

       Hours Worked  Years Experience   Cars Sold
count    999.000000        999.000000  999.000000
mean      33.727728          3.026026    3.922923
std        8.223454          1.394709    1.527000
min       20.000000          1.000000    1.000000
25%       27.000000          2.000000    3.000000
50%       34.000000          3.000000    4.000000
75%       41.000000          4.000000    5.000000
max       48.000000          5.000000    7.000000

In [47]:
data2['Cars Sold'].mean()

3.9229229229229228

In [49]:
data2['Cars Sold'].max()

7

In [50]:
data2['Cars Sold'].min()

1

In [51]:
pd.pivot_table(data2,values=['Cars Sold'], index='Gender',aggfunc='mean')

        Cars Sold
Gender
F        3.760736
M        4.078431

In [52]:
data_c=data2[data2['Cars Sold'] > 3]

In [53]:
pd.pivot_table(data_c,values=['Hours Worked'], index='Cars Sold',aggfunc='mean')

           Hours Worked
Cars Sold
4             33.945545
5             33.184466
6             36.429487
7             43.440000

In [54]:
data2['Years Experience'].mean()

3.026026026026026

In [55]:
pd.pivot_table(data_c,values=['Years Experience'], index='Cars Sold',aggfunc='mean')

           Years Experience
Cars Sold
4                  3.004950
5                  2.961165
6                  3.102564
7                  3.800000

In [57]:
pd.pivot_table(data2,values=['Cars Sold'], index='SalesTraining',aggfunc='mean')

               Cars Sold
SalesTraining
N               3.573850
Y               4.168942